УТ_для_edt/src/InformationRegisters/смартПроксиЛидыROIStat/смартПроксиЛидыROIStat.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартПроксиЛидыROIStat</name>
  <comment>//++ #Б-1678 смарт: Фролов 12.12.2024 //Интеграция с ROIStat. Загрузка ProxyLeads. Создать регистр сведений</comment>
  <resources>
    <name>НеИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерВизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторСделки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДополнительныеПоля</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЭтоСпам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Тип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторROIStat</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/смартПроксиЛидыROIStat/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	УстановитьФильтрНеИспользовать();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "НеИспользовать" Тогда
		
		СтандартнаяОбработка = Ложь;
	
		СписокВыборНаСервере(Элемент.ТекущиеДанные.ИдентификаторROIStat);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НеПоказыватьНеиспользуемыеПриИзменении(Элемент)
	
	УстановитьФильтрНеИспользовать();
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедуры

Процедура УстановитьФильтрНеИспользовать()

	Если НеПоказыватьНеиспользуемые Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "НеИспользовать", Ложь, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	Иначе	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "НеИспользовать", , , , Ложь);
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура СписокВыборНаСервере(ИдентификаторROIStat)
	
	НаборЗаписей = РегистрыСведений.смартПроксиЛидыROIStat.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторROIStat.Установить(ИдентификаторROIStat);
	НаборЗаписей.Прочитать();
	
	НаборЗаписей[0].НеИспользовать = НЕ НаборЗаписей[0].НеИспользовать;
	НаборЗаписей.Записать(Истина);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти
